site/webservice/assigncampaignSocioExistenterequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<AuthenticationHeader soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next" soapenv:mustUnderstand="0"
			xmlns="http://skywards.com/Mercator.CRIS.WS">
			<AuthenticationName>*******</AuthenticationName>
			<AuthenticationPassword>*******</AuthenticationPassword>
		</AuthenticationHeader>
	</soapenv:Header>
	<soapenv:Body>
		<AssignCampaigns
			xmlns="http://skywards.com/Mercator.CRIS.WS">
			<CardNumber>00970011581</CardNumber>
			<CampaignList>
				<Campaign>
					<PrcCode>BF17D</PrcCode>
					<StartDate>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2017-05-01</Value>
					</StartDate>
					<EndDate>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2099-12-31</Value>
					</EndDate>
					<DateTargetted>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2017-09-10</Value>
					</DateTargetted>
					<CardNumber>00970011581</CardNumber>
				</Campaign>
				<Campaign>
					<PrcCode>BF17E</PrcCode>
					<StartDate>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2017-05-01</Value>
					</StartDate>
					<EndDate>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2099-12-31</Value>
					</EndDate>
					<DateTargetted>
						<IsQuery>false</IsQuery>
						<QueryString></QueryString>
						<ContainsQueryOperators>false</ContainsQueryOperators>
						<HasValue>true</HasValue>
						<Value>2017-09-10</Value>
					</DateTargetted>
					<CardNumber>00970011581</CardNumber>
				</Campaign>
			</CampaignList>
		</AssignCampaigns>
	</soapenv:Body>
</soapenv:Envelope>
